W7/D2/music_app/app/models/user.rb

UPDATE "users" SET "session_token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["session_token", "rXBn1THJoYWQQtPeGvJqYQ"], ["updated_at", "2021-10-12 21:44:40.543163"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = User.generate_session_token #resets the session_token of user to diffrent token
    self.save! #if errors out will tell us why