W6/D3/first_route_and_controllers/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
  def index #GET/artworks -> returns all instances
    artworks = Artwork.all

INSERT INTO "artworks" ("title", "image_url", "artist_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "fields of dreams"], ["image_url", "12412.com"], ["artist_id", 7], ["created_at", "2021-10-07 23:31:31.133007"], ["updated_at", "2021-10-07 23:31:31.133007"]]
---
  def create #POST/artworks
    artwork = Artwork.new(artwork_params)
    if artwork.save

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def show #GET/artworks/:id
    artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
  def update #PATCH/PUT/artworks/:id,
    artwork = Artwork.find(params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]
---
  def destroy #DELETE/artworks/:id
    artwork = Artwork.find(params[:id])
    artwork.destroy