W6/D3/first_route_and_controllers/app/controllers/users_controller.rb

  def index # index (GET/users)
    users = User.all
---
SELECT "users".* FROM "users"

  def create #post POST/users
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email") VALUES ($1, $2) RETURNING "id"  [["name", "daniel"], ["email", "daniel@gmail.com"]]

  def show #GET/users/:id
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def update #PATCH/users/:id
    user = User.find(params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "email" = $2 WHERE "users"."id" = $3  [["name", "micahel"], ["email", "asd@safs.com"], ["id", 2]]

  def delete # destroy DELETE/users/:id
    user = User.find(params[:id])
    user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 4]]