W11/D4/todo (part 3)/ThursdayProject/app/controllers/api/todos_controller.rb

  def show
    render json: Todo.find(params[:id])
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def index
    todos = Todo.all
---
SELECT "todos".* FROM "todos"

  def create
    todo = Todo.new(todo_params)
    if todo.save
---
INSERT INTO "todos" ("title", "body", "done", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "watch clippers"], ["body", "they suck"], ["done", true], ["created_at", "2021-11-12 00:15:29.564912"], ["updated_at", "2021-11-12 00:15:29.564912"]]

  def update
    todo = Todo.find(params[:id])
    if todo.update(todo_params)
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "body" = $2, "done" = $3, "updated_at" = $4 WHERE "todos"."id" = $5  [["title", "watch lakers"], ["body", "they suck"], ["done", true], ["updated_at", "2021-11-12 00:14:10.316239"], ["id", 2]]

  def destroy
    todo = Todo.find(params[:id])
    todo.destroy
---
SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 2]]